app/views/users/show.html.erb

<div class='container'>
	<% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]