app/views/photos/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 1]]
---
		<h4>Comments: </h4>
		<%photo.comments.each do |comment| %>