app/controllers/comments_controller.rb

  def index
  	p params
  	@comments = Comment.where(:photo_id => params[:photo_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 1]]

  def create
  	@comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("user_id", "photo_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["photo_id", 2], ["content", "park"], ["created_at", "2018-04-05 19:15:30.409474"], ["updated_at", "2018-04-05 19:15:30.409474"]]