app/controllers/photos_controller.rb

  def create
  	@photo = Photo.create(post_params)
---
INSERT INTO "photos" ("location", "description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
  	@photo = Photo.find(params[:id])
    @photo.update(post_params)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "photos" SET "description" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["description", "Park"], ["updated_at", "2018-04-04 01:37:01.293410"], ["id", 1]]

  def destroy

   p 'i am inside destroy '
    @photo = Photo.find(params[:id])
    binding.pry
    Photo.delete(params['id'])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]